#### FamilySizeTable Members

---

|  |
| --- |
| FamilySizeTable Class   Methods   Properties   See Also |

The  FamilySizeTable  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AsValueString | Gets the table cell value as a string. |
| Public method | Dispose | Releases all resources used by the  FamilySizeTable |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetColumnHeader | Gets a column of the table at at given index. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsValidColumnIndex | Checks if the column index is valid. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NumberOfColumns | Number of columns in the table. |
| Public property | NumberOfRows | Number of rows in the table. |

# See Also

FamilySizeTable Class

Autodesk.Revit.DB Namespace